model {
  ssd {
    num_classes: 1
    inplace_batchnorm_update: true
    freeze_batchnorm: false
    encode_background_as_zeros: true

    box_coder {
      faster_rcnn_box_coder {
        y_scale: 10.0
        x_scale: 10.0
        height_scale: 5.0
        width_scale: 5.0
      }
    }

    matcher {
      argmax_matcher {
        matched_threshold: 0.5
        unmatched_threshold: 0.5
        ignore_thresholds: false
        negatives_lower_than_unmatched: true
        force_match_for_each_row: true
        use_matmul_gather: true
      }
    }

    similarity_calculator { iou_similarity {} }

    anchor_generator {
      multiscale_anchor_generator {
        min_level: 3
        max_level: 7
        anchor_scale: 1.0
        aspect_ratios: [1.0, 0.75, 1.5]
        scales_per_octave: 3
      }
    }

    image_resizer {
      fixed_shape_resizer {
        height: 512
        width: 512
      }
    }

    feature_extractor {
      type: "ssd_mobilenet_v2_fpn_keras"
      depth_multiplier: 1.0
      use_depthwise: true
      min_depth: 16
      override_base_feature_extractor_hyperparams: true

      fpn {
        min_level: 3
        max_level: 7
        additional_layer_depth: 128
      }

      conv_hyperparams {
        activation: RELU_6
        regularizer { l2_regularizer { weight: 0.00004 } }
        initializer {
          random_normal_initializer { mean: 0.0 stddev: 0.01 }
        }
        batch_norm { scale: true decay: 0.997 epsilon: 0.001 }
      }
    }

    box_predictor {
      weight_shared_convolutional_box_predictor {
        depth: 128
        num_layers_before_predictor: 4
        use_depthwise: true
        kernel_size: 3
        class_prediction_bias_init: -4.6

        conv_hyperparams {
          activation: RELU_6
          regularizer { l2_regularizer { weight: 0.00004 } }
          initializer {
            random_normal_initializer { mean: 0.0 stddev: 0.01 }
          }
          batch_norm { scale: true decay: 0.997 epsilon: 0.001 }
        }
      }
    }

    loss {
      classification_loss {
        weighted_sigmoid_focal { alpha: 0.25 gamma: 2.0 }
      }
      localization_loss { weighted_smooth_l1 {} }
      classification_weight: 1.0
      localization_weight: 1.0
    }

    normalize_loss_by_num_matches: true
    normalize_loc_loss_by_codesize: true

    post_processing {
      batch_non_max_suppression {
        score_threshold: 1e-8
        iou_threshold: 0.6
        max_detections_per_class: 50
        max_total_detections: 50
      }
      score_converter: SIGMOID
    }
  }
}

train_config: {
  batch_size: 4
  num_steps: 8000
  sync_replicas: false

  data_augmentation_options { random_horizontal_flip {} }

  optimizer {
    momentum_optimizer {
      learning_rate {
        cosine_decay_learning_rate {
          learning_rate_base: 0.0015
          warmup_learning_rate: 0.0003
          warmup_steps: 300
          total_steps: 8000
        }
      }
      momentum_optimizer_value: 0.9
    }
    use_moving_average: false
  }

  fine_tune_checkpoint_version: V2
  fine_tune_checkpoint: "../../pre_trained_model/ssd_mobilenet_v2_fpnlite_320x320_coco17_tpu-8/checkpoint/ckpt-0"
  fine_tune_checkpoint_type: "detection"

  max_number_of_boxes: 50
  unpad_groundtruth_tensors: false
}

train_input_reader {
  label_map_path: "C:/Users/User/Piglet_Detector/piglet_project/annotations/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "C:/Users/User/Piglet_Detector/piglet_project/annotations/train.tfrecord"
  }
}

eval_config: {
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
}

eval_input_reader {
  label_map_path: "C:/Users/User/Piglet_Detector/piglet_project/annotations/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "C:/Users/User/Piglet_Detector/piglet_project/annotations/valid.tfrecord"
  }
}
